
// Описание
// 
// Параметры:
// 	ПользовательСеанса - ПользовательИнформационнойБазы - 
// Возвращаемое значение:
// 	- СправочникСсылка.Пользователи -
Функция НайтиИлиСоздатьПользователя(ПользовательСеанса) Экспорт
	
	ПользовательСсылка = НайтиПоНаименованию(ПользовательСеанса.Имя);
	
	Если ( ПользовательСсылка.Пустая() ) Тогда
		
		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = ПользовательСеанса.Имя;
		НовыйПользователь.ПолноеИмя = ПользовательСеанса.ПолноеИмя;
		
		ЗаполнитьТаблицуРолей(НовыйПользователь);
		НовыйПользователь.Записать();
		
		ПользовательСсылка = НовыйПользователь.Ссылка;
		 
	КонецЕсли;
	
	Возврат ПользовательСсылка;
	
КонецФункции

Процедура ЗаполнитьТаблицуРолей(Пользователь) Экспорт
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = Пользователь.ПолучитьОбъект();		
	КонецЕсли;
	
	ПользовательСеанса = ПользователиИнформационнойБазы.НайтиПоИмени(Пользователь.Наименование);
	
	Пользователь.СписокПрав.Очистить();
	НаборПрав = Метаданные.Роли;
	
	Для Каждого ТекРоль Из НаборПрав Цикл
		НоваяСтрокаРоли = Пользователь.СписокПрав.Добавить();
		НоваяСтрокаРоли.ИмяРоли = ТекРоль.Имя;
		НоваяСтрокаРоли.ПредставлениеРоли = ТекРоль.Синоним;
		НоваяСтрокаРоли.Активно = ПользовательСеанса.Роли.Содержит(ТекРоль);
	КонецЦикла;
	
	Пользователь.Записать();
	
КонецПроцедуры







