
Процедура ПередЗаписью(Отказ)
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		ТекПользователь.Имя = Наименование;
		ТекПользователь.ПолноеИмя = ПолноеИмя;
	КонецЕсли;
	
	СписокРолей = СписокПрав.НайтиСтроки(Новый Структура( "Активно", Истина));
	
	Для Каждого СтрокаРоли Из СписокРолей Цикл
		ТекПользователь.Роли.Добавить( Метаданные.Роли.Найти(СтрокаРоли.ИмяРоли) );
	КонецЦикла;
	
КонецПроцедуры
